<template lang="pug">
  .contents
    .content
      h2.content-heading Aqui TSUCHIDA ってどんな人？
      .content-body
        p
          | 神奈川の横浜で生まれ育ち、現在は東京で暮らすWebエンジニアです。
          | プログラミングやDIYも含め、ものづくりが大好きで、それ以外では体を鍛えることとゲームと読書も好きです。
        p
          | 一般職やマーケティング、カスタマーサポート、店頭デモなどを経験したあと海外で生活したりバックパッカーとして長期旅行をやりきって帰国、帰国後はイベント制作会社に勤務したものの、コードを書くのが好きだったので一度フルタイムのプログラミングスクールを経てエンジニアとして再就職。
          | 現在に至ります。
        p
          | エンジニアとして禄を食むようになったタイミングとしては遅いほうではありますが、海外で身につけた英語力や、他業種で身につけたコミュニケーションをはじめとしたソフトスキル、武道で培ったストイックさを武器にして立ち回っています。
        p
          | いくつかの仕事をやった結果、どの仕事だろうと苦しいこともあるけどそれなりに楽しんでやる自信はつきましたが、エンジニアとして仕事しているのが一番楽しいので、今後もずっとエンジニアとして生きていこうと考えています。
        p
          | 言語的にはRubyが好きで、主にRailsを使って仕事をしていますが、一方でフロントエンドも好きなので個人的開発のほとんどはVue.js(JavaScript(TypeScript))を使いながら何かを作っています。
          | むしろ個人で開発する場合、サーバーサイドを作りこんだり、保守運用する時間も含めたコストは避けたいのでサーバーレスでTSだけでやる傾向が強いです。そしてそれが楽しいです。
        p
          | 「使いやすい！」と思うものを作ることに熱意を持っています。
          | 主にそれが発揮されるのはフロントエンドやUIなどですが、バックエンドの設計、APIにもそういう思想をもって取り組んでいます。
        p
          | また、エンジニア以外の経験と経歴がエンジニアとして珍しいタイプだと認識されているので、ブログや執筆、登壇などのアウトプットや知見共有、チームビルディングに力を入れることで他のエンジニアが埋めにくい溝を埋める力を発揮し、同時に差別化をしていく生存戦力をとっています。
      h2.content-heading 活動履歴
      .content-body
        h3 作ったもの
        p
          nuxt-link(to="/products") Products
          | にまとめているのでそちらをご参照ください。
        h3 発表
        h4 公表したもの:
        ul
          li
            a(href="https://speakerdeck.com/aquitcd/the-way-to-develop-gas-with-mocking-integration-test-by-jest" target="_blank") GAS開発のJestによるモック入り結合テスト仕立て@【エンジニア交流会】Google Apps Script 活用ミートアップ #3
        h4 業務での評価:
        ul
          li 2017年 社内勉強会 最優秀トーク賞
          li 2018年 社内勉強会 優秀トーク賞
        h3 ブログなど
        ul
          li
            a(href="https://blog.solunita.net/" target="_blank") Trial and Spiral
      h2.content-heading 出来ること/得意なこと
      .content-body
        h3 言語: Ruby, Rails, MySQL, TypeScript, Vue.js, HTML, CSS
        p
          | 上にも書きましたがRubyが好きです。とくに日本人がキレイに書いた英語のようなというか略するところは省略し、より読みやすく、より自然言語に近いのが良い、みたいな共通認識が根付いている文化がとても好きです。
        p
          | RailsでWebアプリケーションを書くのは業務でもやっているので割と得意です。特にモバイルアプリ用のAPIサーバーとして開発しています。自分でフロントエンドはAPIを叩く前提の作りをすることが多いため、APIを使う側、開発側、両方の視点を持っています。
        p
          | 基本的にはMySQLでのRDBを好んでいます。が、単純に経験があるだけで今後はNoSQL系も積極的にやっていきたいと考えています。特に最近はFirebaseに興味があり、Firestoreの良い活用方法とコストまで考慮した実践的運用に強い興味があります。
        p
          | Vue.jsが好きで、わかりやすいSFCの仕組み、Vue-RouterやVuexなどを使って拡張性のあるエコシステムの恩恵が大きいです。またしっかりやらないと自由すぎるが故に辛くなるものを型システムで補助するTypeScriptには本当に助けられてます。
        p
          | HTMLとCSSに関してはセマンティックさを意識した上での適切なマークアップ、CSSはフレームワークを使わずにフルスクラッチで書くこともできます（が、状況に応じて適切に使っていきます）。
          | 生で書くのはあまり好きではなく、基本的にはPug、もしくはSlimで書きたいです。
          | CSSだとStylusが一番好きで、次にSASSが好きです（SCSSももちろん遜色なく書けますが、インデントベースの記法のほうが優れてると判断しているため好んではいません）
        p
          | 自分の中ではテストを書くことは当然で、テスト駆動で開発していくことも好きです。テストは追加開発とリファクタをするときに大いなる盾と信じていますが、世間的にはそうでもないところもあるようです。そういう意味では相対的にテストを書くのは得意なほうと感じます。
        h3 言語: 日本語、英語、スペイン語、広東語
        p
          | 日本語は母語なのでもちろんですが、カスタマーサポートを主とした経験からつつエンジニア文脈だけで話すのではなく相手を意識しコミュニケーションを取るのがどうやら得意なようです。
        p
          | 英語が外国語では一番得意です。オーストラリアで学んでいました。完璧なフォーマルな喋りとまでは難しいですが、失礼のない程度には会話できます。このスキルはプログラミングにも大いに役立っているようで公式ドキュメントを読むことや、（英語的に）良いコーディングをすることに、よりアドバンテージがあるようです。
        p
          | スペイン語は3ヶ月コロンビアで学び、そのあとの合計1年の南米生活で大いに役立ちました。広東語も香港で生活していた時に学び、それなりに話せる程度にはなりました。
        p
        h3 その他: 画像系ソフト、 人前で喋ること
        p
          | IllustratorとPhotoshopはDTPのバイトをしていた経験もあり今も問題なく使えます。基本的に自分の趣味で作るものは全て自分でやります。
        p
          | 店頭デモなどでソフトウェアのデモンストレーションをしたり、機械を実演するプロモーションに携わったことがあります。その経験のおかげなのか人前で何かを伝えるために話すのはちょっと得意なようです。
      h2.content-heading 興味があること
      .content-body
        p
          | 今はプログラミング以外ではチームビルディングにも興味があり、どうすればみんなが気持ちよくプロジェクトを進めていけるか、チームの力を最大化できるか、人が成長するための手助けをできるかということを考えています。
        p
          | UXを最大化するためのUIにも興味があります。デジタルなものだけに限らず「使いやすい」と感じた瞬間に強い幸せと感動を覚えるため、自分もそれを追求していきたいと考えています。
      h2.content-heading 出来ないこと/苦手なこと/興味のあまりないこと
      .content-body
        p
          | サーバーサイドエンジニアとして仕事をしていますが、インフラサイドは守備範囲としてそこまで強くありません。面白味を感じないことはありませんが、アプリケーションとしてのサーバーサイドとフロントエンドにリソースをつぎこむことと割り切ってるので注力していません。
        p
          | また、Faasやサーバーレスで運用する知見と環境が発展してきた背景まで考えて、24時間監視し悩まされ、プライベートを侵食されるエンジニアがいなくなるように願っているからでもあります。
        p
          | UIには多大な興味がありますが見栄えの良いデザインを作ることは得意としていません。体系的な知識や実際に手を動かしての修練が足りていないためです。それで誰かを感動させるよりは、ちゃんとしたデザイナーの人と組んで意見を交わしつつ良いものを作る方向性でいます。
        p
          | 広告に対する考えも薄いです。ビジネスとして必要なケースがあることは理解していますが、個人的には大量消費社会を促進するようなやり方にはあまり興味がわきません。
        p
          | 機械学習系の分野にも今のところは疎いです。興味がゼロではありませんが。
      h2.content-heading 将来的にやりたいこと
      .content-body
        p
          | 2つ。できたらいいな、と思ってることがあります。
        p
          | 1つめ。もっと日本にナチュラルに褒める文化が根付き、人が心理的安全性を高く保ち、お互いに気楽に褒め合うためのに何かに手助けすること。
          | 自身の体験から見ると、日本はどちらかというと叩くファーストに感じられ、また褒めることに強い抵抗感があるように感じています。その抵抗感を薄れさせ、日常にもっと褒める機会を増やし、褒めるファーストの社会になれば、もっとハッピーに暮らせると強く思っています。
          | またそうして攻撃されず、自尊心を高めていけば日本人が苦手とされる自分の意見をちゃんと伝えれるようになり、国際的にももっと上手く立ち周れる人が増えると思っています。
        p
          | 2つめ。スキルの向上や学習、日々の仕事にゲーミフィケーションを用いてもっと楽しくできないか、そのための何かをしたいと思っています。日々の仕事というのはオフィス内だけにとどまらず例えば家事も。気が進まないこともゲーミフィケーションの力でもっと楽しくこなすことができるようになればいいなぁと思っています。
        p
          | ただ、じゃあ今すぐにこの2つにとりかかりたいか、とりかかれるかと言えばそうでもなく、アイデアも技術力も未だ準備中というところです。残念ながら。
          | そしてそれを仕事としてやりたいか、というところも特に考えてません。
      h2.content-heading けっこう聞かれたことがあること
      .content-body
        h3 Q. また海外いっちゃうんじゃないの？
        p
          | A.
          | 日本という国が他国と比較して総合的に判断すると住みやすいと判断しているので日本に住んでいます。今の判断はそう簡単に変わらないので日本で生活をしつづけるつもりです。
          | ただし、なんらかの理由で外国で暮らすとしても、言葉にも苦労するとは思えないですし、劣悪な住環境も経験してるので別に関東から関西に移る程度の抵抗感です。
          | 必要があれば住む場所を変える可能性もゼロではありません、逆に言えば必要がなければ変えません。
</template>
<script lang="ts">
import { Component, Vue } from 'nuxt-property-decorator'
import { State, Action } from 'vuex-class'
@Component
export default class extends Vue {
  // scrollToTop: true
  @State currentPage
  @Action('SELECT_PAGE_BY_NAME') selectPageByName
  async mounted() {
    await this.selectPageByName('thoughts')
  }
}
</script>
<style lang="sass" scoped>
.contents
  width: 80vw
  background-color: rgba(0,0,0,0.6)
  padding-top: 2rem
  border-top-right-radius: 3rem
  border-bottom-right-radius: 3rem
.content
  $outline-color: $bg-color-base
  text-shadow: $outline-color 2px 0,  $outline-color -2px 0, $outline-color 0 -2px, $outline-color 0 2px, $outline-color 2px 2px , $outline-color -2px 2px, $outline-color 2px -2px, $outline-color -2px -2px, $outline-color 1px 2px,  $outline-color -1px 2px, $outline-color 1px -2px, $outline-color -1px -2px, $outline-color 2px 1px,  $outline-color -2px 1px, $outline-color 2px -1px, $outline-color -2px -1px
  &:not(:last-child)
    padding-bottom: 3rem
.content-heading
  border-bottom: 3px solid $grey-base
  font-weight: bold
  font-size: 3rem
  padding-left: 3rem
.content-body
  white-space: pre-wrap
  padding: 1rem 4.5rem 3rem
  font-size: 1.8rem
  p
    padding-bottom: 2rem
    line-height: 1.75
  ul
    padding-left: 3rem
a
  background-color: rgba(0,0,0, 0.4)
  padding: 0.125rem 0.5rem
  border-radius: 0.25rem
  margin: 0 0.125rem
  text-decoration: none
  &:link, &:visited
    color: $primary-color-light
  &:hover
    color: $secondary-color-light
  &:active
    color: $secondary-color-dark
</style>
